toitlang/toit/src/resources/i2c_esp32.cc
// Copyright (C) 2018 Toitware ApS.
//
// This library is free software; you can redistribute it and/or
// modify it under the terms of the GNU Lesser General Public
// License as published by the Free Software Foundation; version
// 2.1 only.
//
// This library is distributed in the hope that it will be useful,
// but WITHOUT ANY WARRANTY; without even the implied warranty of
// MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
// Lesser General Public License for more details.
//
// The license can be found in the file `LICENSE` in the top level
// directory of this repository.

#include "../top.h"

#ifdef TOIT_ESP32

#include <cmath>
#include <driver/i2c_master.h>
#ifdef CONFIG_TOIT_ENABLE_I2C_TARGET
#include <driver/i2c_slave.h>
#endif
#include <freertos/idf_additions.h>
#ifdef CONFIG_TOIT_ENABLE_I2C_TARGET
#include <freertos/message_buffer.h>
#endif
#include <freertos/queue.h>

#include "../linked.h"
#include "../objects_inline.h"
#include "../process.h"
#include "../resource.h"
#include "../utils.h"
#include "../vm.h"

#include "gpio_esp32.h"

#include "../event_sources/ev_queue_esp32.h"

#if CONFIG_I2C_ISR_IRAM_SAFE
#define I2C_IRAM_ATTR IRAM_ATTR
#else
#define I2C_IRAM_ATTR
#endif

namespace toit {

static_assert(SOC_I2C_NUM <= I2C_EVENT_QUEUE_SIZE,
              "Increase I2C_EVENT_QUEUE_SIZE");

class I2cResourceGroup : public ResourceGroup {
 public:
  TAG(I2cResourceGroup);
  I2cResourceGroup(Process* process, EventSource* event_source)
      : ResourceGroup(process, event_source) {}

  uint32_t on_event(Resource* resource, word data, uint32_t state) override {
    return state | data;
  }
};

const word kControllerDoneState = 1 << 0;

#ifdef CONFIG_TOIT_ENABLE_I2C_TARGET

const word kTargetReceiveState = 1 << 0;
const word kTargetRequestState = 1 << 1;
const word kTargetOverflowState = 1 << 2;

class I2cTargetResourceGroup : public ResourceGroup {
 public:
  TAG(I2cTargetResourceGroup);

  I2cTargetResourceGroup(Process* process, EventSource* event_source)
      : ResourceGroup(process, event_source) {}

  uint32_t on_event(Resource* resource, word data, uint32_t state) override {
    return state | data;
  }
};

struct I2cTargetConfig {
  int sda;
  int scl;
  i2c_addr_bit_len_t address_length;
  uint16_t address;
  uint32_t send_buffer_size;
  uint32_t receive_buffer_size;
  bool pullup;
  bool allow_power_down;
  bool broadcast;
};

class I2cTargetResourceBase : public EventQueueResource {
 public:
  I2cTargetResourceBase(ResourceGroup* group, QueueHandle_t event_queue)
      : EventQueueResource(group, event_queue) {}
  ~I2cTargetResourceBase() override;

  i2c_slave_dev_handle_t handle() const { return handle_; }
  GpioPins& owned_pins() { return owned_pins_; }

  esp_err_t initialize_driver(
      const I2cTargetConfig& config,
      const i2c_slave_event_callbacks_t& callbacks,
      void* callback_context);

 protected:
  void release_driver();

 private:
  i2c_slave_dev_handle_t handle_ = null;
  GpioPins owned_pins_;
};

class I2cTargetResource : public I2cTargetResourceBase {
 public:
  TAG(I2cTargetResource);

  I2cTargetResource(I2cTargetResourceGroup* group,
                    QueueHandle_t event_queue,
                    MessageBufferHandle_t receive_buffer)
      : I2cTargetResourceBase(group, event_queue)
      , receive_buffer_(receive_buffer) {
    spinlock_initialize(&spinlock_);
  }

  ~I2cTargetResource() override {
    release_driver();
    vMessageBufferDeleteWithCaps(receive_buffer_);
  }

  MessageBufferHandle_t receive_buffer() const { return receive_buffer_; }

  I2C_IRAM_ATTR bool receive_from_isr(const uint8_t* data, size_t length) {
    BaseType_t higher_was_woken = pdFALSE;
    size_t sent = xMessageBufferSendFromISR(receive_buffer_, data, length, &higher_was_woken);
    signal_from_isr(sent == length ? kTargetReceiveState : kTargetOverflowState,
                    &higher_was_woken);
    if (sent != length) {
      portENTER_CRITICAL_ISR(&spinlock_);
      if (dropped_receive_count_ != Smi::MAX_SMI_VALUE) dropped_receive_count_++;
      portEXIT_CRITICAL_ISR(&spinlock_);
    }
    return higher_was_woken == pdTRUE;
  }

  I2C_IRAM_ATTR bool receive_overflow_from_isr() {
    BaseType_t higher_was_woken = pdFALSE;
    portENTER_CRITICAL_ISR(&spinlock_);
    if (dropped_receive_count_ != Smi::MAX_SMI_VALUE) dropped_receive_count_++;
    portEXIT_CRITICAL_ISR(&spinlock_);
    signal_from_isr(kTargetOverflowState, &higher_was_woken);
    return higher_was_woken == pdTRUE;
  }

  I2C_IRAM_ATTR bool request_from_isr() {
    BaseType_t higher_was_woken = pdFALSE;
    portENTER_CRITICAL_ISR(&spinlock_);
    if (request_count_ != Smi::MAX_SMI_VALUE) request_count_++;
    portEXIT_CRITICAL_ISR(&spinlock_);
    signal_from_isr(kTargetRequestState, &higher_was_woken);
    return higher_was_woken == pdTRUE;
  }

  word take_request_count() {
    portENTER_CRITICAL(&spinlock_);
    word result = request_count_;
    request_count_ = 0;
    portEXIT_CRITICAL(&spinlock_);
    return result;
  }

  word dropped_receive_count() const {
    portENTER_CRITICAL(&spinlock_);
    word result = dropped_receive_count_;
    portEXIT_CRITICAL(&spinlock_);
    return result;
  }

  bool receive_event(word* data) override {
    word unused;
    if (xQueueReceive(queue(), &unused, 0) != pdTRUE) return false;
    portENTER_CRITICAL(&spinlock_);
    *data = pending_event_;
    pending_event_ = 0;
    portEXIT_CRITICAL(&spinlock_);
    return true;
  }

 private:
  I2C_IRAM_ATTR void signal_from_isr(word event, BaseType_t* higher_was_woken) {
    portENTER_CRITICAL_ISR(&spinlock_);
    pending_event_ |= event;
    portEXIT_CRITICAL_ISR(&spinlock_);

    word payload = 0;
    // A full queue already represents a pending notification. The event bits
    // above retain all event kinds until the event-source thread drains it.
    xQueueSendFromISR(queue(), &payload, higher_was_woken);
  }

  MessageBufferHandle_t receive_buffer_;
  mutable spinlock_t spinlock_;
  word pending_event_ = 0;
  word request_count_ = 0;
  word dropped_receive_count_ = 0;
};

class I2cRegisterTargetResource : public I2cTargetResourceBase {
 public:
  TAG(I2cRegisterTargetResource);

  I2cRegisterTargetResource(I2cResourceGroup* group,
                            uint8_t* registers,
                            uint32_t register_count,
                            uint32_t register_address_byte_size)
      : I2cTargetResourceBase(group, null)
      , registers_(registers)
      , register_count_(register_count)
      , register_address_byte_size_(register_address_byte_size) {
    spinlock_initialize(&spinlock_);
  }

  ~I2cRegisterTargetResource() override {
    release_driver();
    free(registers_);
  }

