toitlang/toit/src/resources/i2c_esp32.cc
  I2C_IRAM_ATTR void receive_from_isr(const uint8_t* data, size_t length, bool overflow) {
    if (overflow) {
      portENTER_CRITICAL_ISR(&spinlock_);
      if (dropped_write_count_ != Smi::MAX_SMI_VALUE) dropped_write_count_++;
      portEXIT_CRITICAL_ISR(&spinlock_);
      return;
    }
    if (length < register_address_byte_size_) return;

    uint32_t pointer = 0;
    for (uint32_t i = 0; i < register_address_byte_size_; i++) {
      pointer = (pointer << 8) | data[i];
    }
    pointer %= register_count_;
    for (size_t i = register_address_byte_size_; i < length; i++) {
      store_register_from_isr(pointer, data[i]);
      pointer++;
      if (pointer == register_count_) pointer = 0;
    }
    register_pointer_ = pointer;
    prefetch_pointer_ = pointer;
  }

  I2C_IRAM_ATTR const uint8_t* transmit_from_isr(size_t capacity, size_t* length) {
    size_t remaining = register_count_ - prefetch_pointer_;
    size_t result_length = capacity < remaining ? capacity : remaining;
    if (result_length > sizeof(transmit_buffer_)) {
      result_length = sizeof(transmit_buffer_);
    }
    for (size_t i = 0; i < result_length; i++) {
      transmit_buffer_[i] = load_register_from_isr(prefetch_pointer_ + i);
    }
    prefetch_pointer_ += result_length;
    if (prefetch_pointer_ == register_count_) prefetch_pointer_ = 0;
    *length = result_length;
    return transmit_buffer_;
  }

  I2C_IRAM_ATTR void transmit_done_from_isr(size_t length) {
    uint32_t advance = length % register_count_;
    register_pointer_ = advance < register_count_ - register_pointer_
        ? register_pointer_ + advance
        : advance - (register_count_ - register_pointer_);
    prefetch_pointer_ = register_pointer_;
  }

  int get(uint32_t index) const {
    return load_register(index);
  }

  void set(uint32_t index, uint8_t value) {
    store_register(index, value);
  }

  void read(uint32_t index, uint8_t* destination, uint32_t length) const {
    for (uint32_t i = 0; i < length; i++) {
      destination[i] = load_register(index + i);
    }
  }

  void write(uint32_t index, const uint8_t* source, uint32_t length) {
    for (uint32_t i = 0; i < length; i++) {
      store_register(index + i, source[i]);
    }
  }

  word dropped_write_count() const {
    portENTER_CRITICAL(&spinlock_);
    word result = dropped_write_count_;
    portEXIT_CRITICAL(&spinlock_);
    return result;
  }

  uint32_t register_count() const { return register_count_; }

 private:
  uint8_t load_register(uint32_t index) const {
    portENTER_CRITICAL(&spinlock_);
    uint8_t result = registers_[index];
    portEXIT_CRITICAL(&spinlock_);
    return result;
  }

  void store_register(uint32_t index, uint8_t value) {
    portENTER_CRITICAL(&spinlock_);
    registers_[index] = value;
    portEXIT_CRITICAL(&spinlock_);
  }

  I2C_IRAM_ATTR uint8_t load_register_from_isr(uint32_t index) const {
    portENTER_CRITICAL_ISR(&spinlock_);
    uint8_t result = registers_[index];
    portEXIT_CRITICAL_ISR(&spinlock_);
    return result;
  }

  I2C_IRAM_ATTR void store_register_from_isr(uint32_t index, uint8_t value) {
    portENTER_CRITICAL_ISR(&spinlock_);
    registers_[index] = value;
    portEXIT_CRITICAL_ISR(&spinlock_);
  }

  uint8_t* registers_;
  uint8_t transmit_buffer_[SOC_I2C_FIFO_LEN];
  uint32_t register_count_;
  uint32_t register_address_byte_size_;
  uint32_t register_pointer_ = 0;
  uint32_t prefetch_pointer_ = 0;
  mutable spinlock_t spinlock_;
  word dropped_write_count_ = 0;
};

I2cTargetResourceBase::~I2cTargetResourceBase() {
  ASSERT(handle_ == null);
  if (queue() != null) vQueueDeleteWithCaps(queue());
  owned_pins_.release();
}

esp_err_t I2cTargetResourceBase::initialize_driver(
    const I2cTargetConfig& config,
    const i2c_slave_event_callbacks_t& callbacks,
    void* callback_context) {
  ASSERT(handle_ == null);
  i2c_slave_config_t driver_config = {
    .i2c_port = -1,
    .sda_io_num = static_cast<gpio_num_t>(config.sda),
    .scl_io_num = static_cast<gpio_num_t>(config.scl),
    .clk_source = I2C_CLK_SRC_DEFAULT,
    .send_buf_depth = config.send_buffer_size,
    .receive_buf_depth = config.receive_buffer_size,
    .slave_addr = config.address,
    .addr_bit_len = config.address_length,
    .intr_priority = 0,
    .flags = {
      .allow_pd = config.allow_power_down,
      .enable_internal_pullup = config.pullup,
      #if SOC_I2C_SLAVE_SUPPORT_BROADCAST
      .broadcast_en = config.broadcast,
      #endif
    },
  };
  i2c_slave_dev_handle_t handle;
  esp_err_t err = i2c_new_slave_device(&driver_config, &handle);
  if (err != ESP_OK) return err;
  handle_ = handle;
  return i2c_slave_register_event_callbacks(
      handle_, &callbacks, callback_context);
}

void I2cTargetResourceBase::release_driver() {
  if (handle_ == null) return;
  ESP_ERROR_CHECK(i2c_del_slave_device(handle_));
  handle_ = null;
}

#endif  // CONFIG_TOIT_ENABLE_I2C_TARGET

class I2cBusResource;
class I2cDeviceResource;
typedef DoubleLinkedList<I2cDeviceResource, 99> DeviceList;

class I2cDeviceResource : public EventQueueResource, public DeviceList::Element {
 public:
  TAG(I2cDeviceResource);
  I2cDeviceResource(I2cResourceGroup* group,
                    I2cBusResource* bus)
      : EventQueueResource(group, null)
      , bus_(bus)
      , handle_(null) {}

  ~I2cDeviceResource() override;

  i2c_master_dev_handle_t handle() const { return handle_; }
  I2cBusResource* bus() const { return bus_; }
  void set_handle(i2c_master_dev_handle_t handle) { handle_ = handle; }

 private:
  friend class I2cBusResource;
  I2cBusResource* bus_;
  i2c_master_dev_handle_t handle_;
};

class I2cBusResource : public EventQueueResource, public DeviceList {
 public:
  TAG(I2cBusResource);
  I2cBusResource(I2cResourceGroup* group, QueueHandle_t queue)
      : EventQueueResource(group, queue)
      , handle_(null) {}

  ~I2cBusResource() override;

  i2c_master_bus_handle_t handle() const { return handle_; }
  void set_handle(i2c_master_bus_handle_t handle) { handle_ = handle; }

