toitlang/toit/src/resources/i2c_esp32.cc
  void add_device(I2cDeviceResource* device);
  void remove_device(I2cDeviceResource* device);

  I2C_IRAM_ATTR bool complete_from_isr(i2c_master_event_t event) {
    completion_event_ = event;
    BaseType_t higher_was_woken = pdFALSE;
    word payload = kControllerDoneState;
    xQueueSendFromISR(queue(), &payload, &higher_was_woken);
    return higher_was_woken == pdTRUE;
  }

  bool receive_event(word* data) override {
    return xQueueReceive(queue(), data, 0) == pdTRUE;
  }

  bool operation_in_flight() const { return operation_in_flight_; }

  void discard_completion() {
    word payload;
    while (xQueueReceive(queue(), &payload, 0) == pdTRUE) {}
    resource_group()->event_source()->set_state(this, 0);
    completion_event_ = I2C_EVENT_ALIVE;
  }

  void prepare_operation(uint8_t* tx_buffer,
                         uint8_t* rx_buffer,
                         size_t rx_length,
                         i2c_master_dev_handle_t probe_handle = null) {
    ASSERT(!operation_in_flight_);
    tx_buffer_ = tx_buffer;
    rx_buffer_ = rx_buffer;
    rx_length_ = rx_length;
    probe_handle_ = probe_handle;
    completion_event_ = I2C_EVENT_ALIVE;
    operation_in_flight_ = true;
  }

  void cancel_prepared_operation() {
    ASSERT(operation_in_flight_);
    operation_in_flight_ = false;
    tx_buffer_ = null;
    rx_buffer_ = null;
    rx_length_ = 0;
    probe_handle_ = null;
    completion_event_ = I2C_EVENT_ALIVE;
  }

  i2c_master_event_t completion_event() const { return completion_event_; }
  uint8_t* tx_buffer() const { return tx_buffer_; }
  uint8_t* rx_buffer() const { return rx_buffer_; }
  size_t rx_length() const { return rx_length_; }

  void finish_operation();

  GpioPins& owned_pins() { return owned_pins_; }

  I2cResourceGroup* resource_group() const {
    return static_cast<I2cResourceGroup*>(Resource::resource_group());
  }

 private:
  i2c_master_bus_handle_t handle_;
  volatile i2c_master_event_t completion_event_ = I2C_EVENT_ALIVE;
  bool operation_in_flight_ = false;
  uint8_t* tx_buffer_ = null;
  uint8_t* rx_buffer_ = null;
  size_t rx_length_ = 0;
  i2c_master_dev_handle_t probe_handle_ = null;
  // GPIO pins reserved by this bus.
  GpioPins owned_pins_;
};

I2cDeviceResource::~I2cDeviceResource() {
  if (bus_ != null && handle_ != null) {
    bus_->remove_device(this);
  }
}

I2cBusResource::~I2cBusResource() {
  // Bus.close is serialized with controller operations. Any canceled operation
  // has been aborted and its native buffers released before teardown gets here.
  ASSERT(!operation_in_flight_);
  while (!DeviceList::is_empty()) {
    // Removing the device doesn't delete the `I2cDeviceResource`, but only modifies
    // it so it doesn't have any handle anymore. The `I2cDeviceResource` still needs to
    // be deleted.
    remove_device(DeviceList::first());
  }
  if (handle_ != null) ESP_ERROR_CHECK(i2c_del_master_bus(handle()));
  vQueueDeleteWithCaps(queue());
  // Release any GPIO pins this bus reserved.
  owned_pins_.release();
}

void I2cBusResource::add_device(I2cDeviceResource* device) {
  DeviceList::append(device);
}

void I2cBusResource::remove_device(I2cDeviceResource* device) {
  ASSERT(device->bus_ == this);
  i2c_master_event_callbacks_t callbacks = {};
  i2c_master_register_event_callbacks(device->handle(), &callbacks, null);
  i2c_master_bus_rm_device(device->handle());
  device->bus_ = null;
  device->handle_ = null;
  DeviceList::unlink(device);
}

void I2cBusResource::finish_operation() {
  ASSERT(operation_in_flight_);
  if (probe_handle_ != null) {
    i2c_master_event_callbacks_t callbacks = {};
    i2c_master_register_event_callbacks(probe_handle_, &callbacks, null);
    i2c_master_bus_rm_device(probe_handle_);
  }
  free(tx_buffer_);
  free(rx_buffer_);
  cancel_prepared_operation();
}


MODULE_IMPLEMENTATION(i2c, MODULE_I2C);

PRIMITIVE(init) {
  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  I2cResourceGroup* i2c = _new I2cResourceGroup(process, EventQueueEventSource::instance());
  if (!i2c) {
    FAIL(MALLOC_FAILED);
  }

  proxy->set_external_address(i2c);
  return proxy;
}

#ifdef CONFIG_TOIT_ENABLE_I2C_TARGET

PRIMITIVE(target_init) {
  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  auto group = _new I2cTargetResourceGroup(process, EventQueueEventSource::instance());
  if (group == null) FAIL(MALLOC_FAILED);

  proxy->set_external_address(group);
  return proxy;
}

I2C_IRAM_ATTR static bool target_receive_handler(
    i2c_slave_dev_handle_t handle,
    const i2c_slave_rx_done_event_data_t* event,
    void* context) {
  auto resource = unvoid_cast<I2cTargetResource*>(context);
  if (event->overflow) return resource->receive_overflow_from_isr();
  return resource->receive_from_isr(event->buffer, event->length);
}

I2C_IRAM_ATTR static bool target_request_handler(
    i2c_slave_dev_handle_t handle,
    const i2c_slave_request_event_data_t* event,
    void* context) {
  auto resource = unvoid_cast<I2cTargetResource*>(context);
  return resource->request_from_isr();
}

static bool decode_target_address(
    int address_bit_size,
    uint16_t address,
    i2c_addr_bit_len_t* address_length) {
  if (address_bit_size == 7 && address <= 0x7f) {
    *address_length = I2C_ADDR_BIT_LEN_7;
    return true;
  }
#if SOC_I2C_SUPPORT_10BIT_ADDR
  if (address_bit_size == 10 && address <= 0x3ff) {
    *address_length = I2C_ADDR_BIT_LEN_10;
    return true;
  }
#endif
  return false;
}

PRIMITIVE(target_create) {
  ARGS(I2cTargetResourceGroup, group,
       int, sda,
       int, scl,
       int, address_bit_size,
       uint16, address,
       uint32, send_buffer_size,
       uint32, receive_buffer_size,
       bool, pullup,
       bool, allow_power_down,
       bool, broadcast,
       Blob, default_response);

  if (send_buffer_size == 0 || receive_buffer_size == 0 ||
      default_response.length() == 0 ||
      default_response.length() > SOC_I2C_FIFO_LEN) {
    FAIL(INVALID_ARGUMENT);
  }

  i2c_addr_bit_len_t address_length;
  if (!decode_target_address(
          address_bit_size, address, &address_length)) FAIL(INVALID_ARGUMENT);

  #if !SOC_I2C_SLAVE_SUPPORT_BROADCAST
  if (broadcast) FAIL(UNSUPPORTED);
  #endif

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  GpioPinReserver reserver;
  bool reserve_ok = true;
  int sda_num = reserver.decode_and_take(sda, &reserve_ok);
  int scl_num = reserver.decode_and_take(scl, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);

  bool handed_to_resource = false;

  QueueHandle_t event_queue = xQueueCreateWithCaps(
      1, sizeof(word), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (event_queue == null) FAIL(MALLOC_FAILED);
  Defer delete_event_queue {
    [&] { if (!handed_to_resource) vQueueDeleteWithCaps(event_queue); }
  };

  size_t message_buffer_size = receive_buffer_size + sizeof(size_t) + 1;
  if (message_buffer_size < receive_buffer_size) FAIL(INVALID_ARGUMENT);
  MessageBufferHandle_t receive_buffer = xMessageBufferCreateWithCaps(
      message_buffer_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (receive_buffer == null) FAIL(MALLOC_FAILED);
  Defer delete_receive_buffer {
    [&] { if (!handed_to_resource) vMessageBufferDeleteWithCaps(receive_buffer); }
  };

  auto resource = _new I2cTargetResource(group, event_queue, receive_buffer);
  if (resource == null) FAIL(MALLOC_FAILED);
  handed_to_resource = true;
  bool registered = false;
  Defer delete_resource { [&] { if (!registered) delete resource; } };

  I2cTargetConfig config = {
    .sda = sda_num,
    .scl = scl_num,
    .address_length = address_length,
    .address = address,
    .send_buffer_size = send_buffer_size,
    .receive_buffer_size = receive_buffer_size,
    .pullup = pullup,
    .allow_power_down = allow_power_down,
    .broadcast = broadcast,
  };
  i2c_slave_event_callbacks_t callbacks = {
    .on_request = target_request_handler,
    .on_receive = target_receive_handler,
    .on_transmit = null,
    .on_transmit_done = null,
  };
  esp_err_t err = resource->initialize_driver(config, callbacks, resource);
  if (err == ESP_ERR_NOT_FOUND) FAIL(ALREADY_IN_USE);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  err = i2c_slave_set_default_response(
      resource->handle(), default_response.address(), default_response.length());
  if (err != ESP_OK) return Primitive::os_error(err, process);

