toitlang/toit/src/resources/i2c_esp32.cc
  resource->owned_pins().adopt(reserver);
  reserver.keep();
  group->register_resource(resource);
  proxy->set_external_address(resource);
  registered = true;
  return proxy;
}

PRIMITIVE(target_close) {
  ARGS(I2cTargetResourceGroup, group, I2cTargetResource, target);
  group->unregister_resource(target);
  target_proxy->clear_external_address();
  return process->null_object();
}

PRIMITIVE(target_receive) {
  ARGS(I2cTargetResource, target);

  auto receive_buffer = target->receive_buffer();
  size_t length = xMessageBufferNextLengthBytes(receive_buffer);
  if (length == 0) return process->null_object();

  ByteArray* result = process->allocate_byte_array(length);
  if (result == null) FAIL(ALLOCATION_FAILED);

  size_t received = xMessageBufferReceive(
      receive_buffer, ByteArray::Bytes(result).address(), length, 0);
  ASSERT(received == length);
  return result;
}

PRIMITIVE(target_write) {
  ARGS(I2cTargetResource, target, Blob, buffer, uint32, offset);
  if (offset > buffer.length()) FAIL(OUT_OF_BOUNDS);
  uint32_t length = buffer.length() - offset;
  if (length == 0) return Smi::zero();

  uint32_t written = 0;
  esp_err_t err = i2c_slave_write(
      target->handle(), buffer.address() + offset, length, &written, 0);
  if (err != ESP_OK) {
    return Primitive::os_error(err, process);
  }
  ASSERT(Smi::is_valid(written));
  return Smi::from(written);
}

PRIMITIVE(target_set_write_pending) {
  ARGS(I2cTargetResource, target, bool, pending);
  esp_err_t err = i2c_slave_set_buffered_write_pending(target->handle(), pending);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  return process->null_object();
}

PRIMITIVE(target_set_handler_mode) {
  ARGS(I2cTargetResource, target, bool, enabled);
#if SOC_I2C_SLAVE_CAN_GET_STRETCH_CAUSE
  esp_err_t err = i2c_slave_set_default_response_enabled(
      target->handle(), !enabled);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  return process->null_object();
#else
  if (enabled) FAIL(UNSUPPORTED);
  return process->null_object();
#endif
}

PRIMITIVE(target_take_request_count) {
  ARGS(I2cTargetResource, target);
  return Smi::from(target->take_request_count());
}

PRIMITIVE(target_dropped_receive_count) {
  ARGS(I2cTargetResource, target);
  return Smi::from(target->dropped_receive_count());
}

I2C_IRAM_ATTR static bool register_target_receive_handler(
    i2c_slave_dev_handle_t handle,
    const i2c_slave_rx_done_event_data_t* event,
    void* context) {
  auto resource = unvoid_cast<I2cRegisterTargetResource*>(context);
  resource->receive_from_isr(event->buffer, event->length, event->overflow);
  return false;
}

I2C_IRAM_ATTR static bool register_target_transmit_handler(
    i2c_slave_dev_handle_t handle,
    i2c_slave_transmit_event_data_t* event,
    void* context) {
  auto resource = unvoid_cast<I2cRegisterTargetResource*>(context);
  size_t length = 0;
  event->buffer = resource->transmit_from_isr(event->buffer_size, &length);
  event->length = length;
  return false;
}

I2C_IRAM_ATTR static bool register_target_transmit_done_handler(
    i2c_slave_dev_handle_t handle,
    const i2c_slave_transmit_done_event_data_t* event,
    void* context) {
  auto resource = unvoid_cast<I2cRegisterTargetResource*>(context);
  resource->transmit_done_from_isr(event->length);
  return false;
}

PRIMITIVE(register_target_create) {
  ARGS(I2cResourceGroup, group,
       int, sda,
       int, scl,
       int, address_bit_size,
       uint16, address,
       uint32, register_count,
       uint32, register_address_byte_size,
       uint32, receive_buffer_size,
       bool, pullup,
       bool, allow_power_down,
       bool, broadcast);

  if (register_count == 0) FAIL(INVALID_ARGUMENT);
  if (register_address_byte_size != 1 && register_address_byte_size != 2) FAIL(INVALID_ARGUMENT);
  if (receive_buffer_size < register_address_byte_size) FAIL(INVALID_ARGUMENT);
  uint32_t addressable_register_count = 1u << (register_address_byte_size * 8);
  if (register_count > addressable_register_count) FAIL(INVALID_ARGUMENT);

  i2c_addr_bit_len_t address_length;
  if (!decode_target_address(
          address_bit_size, address, &address_length)) FAIL(INVALID_ARGUMENT);

  #if !SOC_I2C_SLAVE_SUPPORT_BROADCAST
  if (broadcast) FAIL(UNSUPPORTED);
  #endif

  #if !SOC_I2C_SLAVE_CAN_GET_STRETCH_CAUSE
  FAIL(UNSUPPORTED);
  #endif

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  auto registers = unvoid_cast<uint8_t*>(heap_caps_calloc(
      register_count, sizeof(uint8_t), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  if (registers == null) FAIL(MALLOC_FAILED);
  bool handed_to_resource = false;
  Defer free_registers { [&] { if (!handed_to_resource) free(registers); } };

  GpioPinReserver reserver;
  bool reserve_ok = true;
  int sda_num = reserver.decode_and_take(sda, &reserve_ok);
  int scl_num = reserver.decode_and_take(scl, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);

  auto resource = _new I2cRegisterTargetResource(
      group, registers, register_count, register_address_byte_size);
  if (resource == null) FAIL(MALLOC_FAILED);
  handed_to_resource = true;
  bool registered = false;
  Defer delete_resource { [&] { if (!registered) delete resource; } };

  I2cTargetConfig config = {
    .sda = sda_num,
    .scl = scl_num,
    .address_length = address_length,
    .address = address,
    .send_buffer_size = SOC_I2C_FIFO_LEN,
    .receive_buffer_size = receive_buffer_size,
    .pullup = pullup,
    .allow_power_down = allow_power_down,
    .broadcast = broadcast,
  };
  i2c_slave_event_callbacks_t callbacks = {
    .on_request = null,
    .on_receive = register_target_receive_handler,
    .on_transmit = register_target_transmit_handler,
    .on_transmit_done = register_target_transmit_done_handler,
  };
  esp_err_t err = resource->initialize_driver(config, callbacks, resource);
  if (err == ESP_ERR_NOT_FOUND) FAIL(ALREADY_IN_USE);
  if (err != ESP_OK) return Primitive::os_error(err, process);

