toitlang/toit/src/resources/i2c_esp32.cc
  resource->owned_pins().adopt(reserver);
  reserver.keep();
  group->register_resource(resource);
  proxy->set_external_address(resource);
  registered = true;
  return proxy;
}

PRIMITIVE(register_target_close) {
  ARGS(I2cResourceGroup, group, I2cRegisterTargetResource, target);
  group->unregister_resource(target);
  target_proxy->clear_external_address();
  return process->null_object();
}

PRIMITIVE(register_target_get) {
  ARGS(I2cRegisterTargetResource, target, uint32, index);
  if (index >= target->register_count()) FAIL(OUT_OF_BOUNDS);
  return Smi::from(target->get(index));
}

PRIMITIVE(register_target_set) {
  ARGS(I2cRegisterTargetResource, target, uint32, index, uint8, value);
  if (index >= target->register_count()) FAIL(OUT_OF_BOUNDS);
  target->set(index, value);
  return Smi::from(value);
}

PRIMITIVE(register_target_read) {
  ARGS(I2cRegisterTargetResource, target, uint32, index, uint32, length);
  if (index > target->register_count()) FAIL(OUT_OF_BOUNDS);
  if (length > target->register_count() - index) FAIL(OUT_OF_BOUNDS);
  ByteArray* result = process->allocate_byte_array(length);
  if (result == null) FAIL(ALLOCATION_FAILED);
  target->read(index, ByteArray::Bytes(result).address(), length);
  return result;
}

PRIMITIVE(register_target_write) {
  ARGS(I2cRegisterTargetResource, target, uint32, index, Blob, bytes);
  if (index > target->register_count()) FAIL(OUT_OF_BOUNDS);
  if (bytes.length() > target->register_count() - index) FAIL(OUT_OF_BOUNDS);
  target->write(index, bytes.address(), bytes.length());
  return process->null_object();
}

PRIMITIVE(register_target_dropped_write_count) {
  ARGS(I2cRegisterTargetResource, target);
  return Smi::from(target->dropped_write_count());
}

#else

PRIMITIVE(target_init)                          { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_create)                        { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_close)                         { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_receive)                       { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_write)                         { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_set_write_pending)             { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_set_handler_mode)              { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_take_request_count)            { FAIL(UNIMPLEMENTED); }
PRIMITIVE(target_dropped_receive_count)          { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_create)               { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_close)                { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_get)                  { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_set)                  { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_read)                 { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_write)                { FAIL(UNIMPLEMENTED); }
PRIMITIVE(register_target_dropped_write_count)  { FAIL(UNIMPLEMENTED); }

#endif  // CONFIG_TOIT_ENABLE_I2C_TARGET

PRIMITIVE(bus_create) {
  ARGS(I2cResourceGroup, group, int, sda, int, scl, bool, pullup);

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  // Decode the pins and reserve them from the shared
  // pool. The reserver releases everything again if we leave without calling
  // `keep()`.
  GpioPinReserver reserver;
  bool reserve_ok = true;
  int sda_num = reserver.decode_and_take(sda, &reserve_ok);
  int scl_num = reserver.decode_and_take(scl, &reserve_ok);
  if (!reserve_ok) FAIL(ALREADY_IN_USE);

  QueueHandle_t event_queue = xQueueCreateWithCaps(
      1, sizeof(word), MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (event_queue == null) FAIL(MALLOC_FAILED);

  auto resource = _new I2cBusResource(group, event_queue);
  if (resource == null) {
    vQueueDeleteWithCaps(event_queue);
    FAIL(MALLOC_FAILED);
  }
  bool registered = false;
  Defer delete_resource { [&] { if (!registered) delete resource; } };

  i2c_master_bus_config_t config = {
    .i2c_port = -1,  // Auto select.
    .sda_io_num = static_cast<gpio_num_t>(sda_num),
    .scl_io_num = static_cast<gpio_num_t>(scl_num),
    .clk_source = I2C_CLK_SRC_DEFAULT,
    .glitch_ignore_cnt = 7,
    .intr_priority = 0,
    // Toit serializes operations before entering ESP-IDF, so the driver's
    // queue is only used to enable completion callbacks. Keeping its depth at
    // one also prevents calls from entering the driver's blocking queue path.
    .trans_queue_depth = 1,
    .flags = {
      .enable_internal_pullup = pullup,
      .allow_pd = false,
    },
  };
  i2c_master_bus_handle_t handle;
  esp_err_t err = i2c_new_master_bus(&config, &handle);
  if (err == ESP_ERR_NOT_FOUND) FAIL(ALREADY_IN_USE);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  resource->set_handle(handle);

  // The reservation now belongs to the resource and is released on close.
  resource->owned_pins().adopt(reserver);
  reserver.keep();

  group->register_resource(resource);
  proxy->set_external_address(resource);
  registered = true;

  return proxy;
}

I2C_IRAM_ATTR static bool controller_done_handler(
    i2c_master_dev_handle_t handle,
    const i2c_master_event_data_t* event,
    void* context) {
  USE(handle);
  auto bus = unvoid_cast<I2cBusResource*>(context);
  return bus->complete_from_isr(event->event);
}

PRIMITIVE(bus_close) {
  ARGS(I2cBusResource, resource);
  resource->resource_group()->unregister_resource(resource);
  resource_proxy->clear_external_address();
  return process->null_object();
}

PRIMITIVE(bus_probe) {
  ARGS(I2cBusResource, resource, uint16, address, int, timeout_ms);
  if (address > 0x7f || timeout_ms < 0) FAIL(INVALID_ARGUMENT);
  if (resource->operation_in_flight()) FAIL(INVALID_STATE);

  // Keep the explicit address byte alive until the asynchronous transaction
  // completes.  Allocating it first also leaves all later error paths free to
  // report ESP_ERR_NO_MEM synchronously and retry the primitive safely.
  uint8_t* address_buffer = unvoid_cast<uint8_t*>(heap_caps_malloc(
      1, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
  if (address_buffer == null) return Primitive::os_error(ESP_ERR_NO_MEM, process);
  address_buffer[0] = address << 1;
  bool prepared = false;
  Defer free_address {
    [&] { if (!prepared) free(address_buffer); }
  };

  uint64_t timeout_us = static_cast<uint64_t>(timeout_ms) * 1000;
  if (timeout_us > UINT32_MAX) FAIL(INVALID_ARGUMENT);
  i2c_device_config_t config = {
    .dev_addr_length = I2C_ADDR_BIT_LEN_7,
    // The address is emitted explicitly below so its WRITE command can check
    // the ACK.  A START/address/STOP transaction generated by the regular
    // device path does not attach ACK checking to the address-only transfer.
    .device_address = I2C_DEVICE_ADDRESS_NOT_USED,
    .scl_speed_hz = 100000,
    .scl_wait_us = static_cast<uint32_t>(timeout_us),
    .flags = {
      .disable_ack_check = false,
    },
  };

