toitlang/toit/src/resources/i2c_esp32.cc
  i2c_master_dev_handle_t handle;
  esp_err_t err = i2c_master_bus_add_device(resource->handle(), &config, &handle);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  Defer remove_device {
    [&] { if (!prepared) i2c_master_bus_rm_device(handle); }
  };

  i2c_master_event_callbacks_t callbacks = {
    .on_trans_done = controller_done_handler,
  };
  err = i2c_master_register_event_callbacks(handle, &callbacks, resource);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  resource->prepare_operation(address_buffer, null, 0, handle);
  prepared = true;
  bool dispatched = false;
  Defer cancel_operation {
    [&] { if (!dispatched) resource->finish_operation(); }
  };

  i2c_operation_job_t operations[3] = {};
  operations[0].command = I2C_MASTER_CMD_START;
  operations[1].command = I2C_MASTER_CMD_WRITE;
  operations[1].write.ack_check = true;
  operations[1].write.data = resource->tx_buffer();
  operations[1].write.total_bytes = 1;
  operations[2].command = I2C_MASTER_CMD_STOP;
  err = i2c_master_execute_defined_operations(
      handle, operations, ARRAY_SIZE(operations), timeout_ms);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  dispatched = true;
  return process->null_object();
}

// The first three values must be synchronized with the CONTROLLER-RESULT-*
// constants in lib/i2c.toit.
enum ControllerResult {
  CONTROLLER_RESULT_OK = 0,
  CONTROLLER_RESULT_NACK = 1,
  CONTROLLER_RESULT_TIMEOUT = 2,
  CONTROLLER_RESULT_INVALID = 3,
};

static ControllerResult controller_result(i2c_master_event_t event) {
  switch (event) {
    case I2C_EVENT_DONE: return CONTROLLER_RESULT_OK;
    case I2C_EVENT_NACK: return CONTROLLER_RESULT_NACK;
    case I2C_EVENT_TIMEOUT: return CONTROLLER_RESULT_TIMEOUT;
    default: return CONTROLLER_RESULT_INVALID;
  }
}

PRIMITIVE(bus_probe_finish) {
  ARGS(I2cBusResource, resource);
  if (!resource->operation_in_flight()) FAIL(INVALID_STATE);
  ControllerResult result = controller_result(resource->completion_event());
  resource->finish_operation();
  if (result == CONTROLLER_RESULT_INVALID) FAIL(INVALID_STATE);
  return BOOL(result == CONTROLLER_RESULT_OK);
}

PRIMITIVE(bus_abort_controller_operation) {
  ARGS(I2cBusResource, resource);
  if (!resource->operation_in_flight()) return process->null_object();

  // ESP_ERR_INVALID_STATE means that completion won the race. The abort API
  // still synchronizes with the ISR before reporting that there was no active
  // transaction. First retire it so IDF can no longer access the Toit-owned
  // buffers, then make a bounded best-effort attempt to recover the physical
  // bus. Recovery failure must not hide the deadline or cancellation that
  // brought us here; the next operation reports a bus that remains stuck.
  esp_err_t err = i2c_master_bus_abort_transaction(resource->handle());
  if (err != ESP_OK && err != ESP_ERR_INVALID_STATE) FATAL_IF_NOT_ESP_OK(err);
  if (err == ESP_OK) i2c_master_bus_reset(resource->handle());
  resource->discard_completion();
  resource->finish_operation();
  return process->null_object();
}

PRIMITIVE(device_create) {
  ARGS(I2cBusResource, bus,
       int, address_bit_size,
       uint16, address,
       uint32, frequency_hz,
       uint32, timeout_us,
       bool, disable_ack_check)

  i2c_addr_bit_len_t dev_addr_length;
  if (address_bit_size == 7 && address <= 0x7f) {
    dev_addr_length = I2C_ADDR_BIT_LEN_7;
  #if SOC_I2C_SUPPORT_10BIT_ADDR
  } else if (address_bit_size == 10 && address <= 0x3ff) {
    dev_addr_length = I2C_ADDR_BIT_LEN_10;
  #endif
  } else {
    FAIL(INVALID_ARGUMENT);
  }

  ByteArray* proxy = process->object_heap()->allocate_proxy();
  if (proxy == null) FAIL(ALLOCATION_FAILED);

  auto resource = _new I2cDeviceResource(bus->resource_group(), bus);
  if (resource == null) FAIL(MALLOC_FAILED);
  bool registered = false;
  Defer delete_resource { [&] { if (!registered) delete resource; } };

  i2c_device_config_t config = {
    .dev_addr_length = dev_addr_length,
    .device_address = address,
    .scl_speed_hz = frequency_hz,
    .scl_wait_us = timeout_us == 0 ? 100000 : timeout_us,
    .flags = {
      .disable_ack_check = disable_ack_check,
    },
  };
  i2c_master_dev_handle_t handle;
  esp_err_t err = i2c_master_bus_add_device(bus->handle(), &config, &handle);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  resource->set_handle(handle);
  bus->add_device(resource);

  i2c_master_event_callbacks_t callbacks = {
    .on_trans_done = controller_done_handler,
  };
  err = i2c_master_register_event_callbacks(handle, &callbacks, bus);
  if (err != ESP_OK) return Primitive::os_error(err, process);

  bus->resource_group()->register_resource(resource);
  proxy->set_external_address(resource);
  registered = true;

  return proxy;
}

PRIMITIVE(device_close) {
  ARGS(I2cDeviceResource, resource);

  resource->resource_group()->unregister_resource(resource);
  resource_proxy->clear_external_address();
  return process->null_object();
}

static esp_err_t prepare_controller_operation(I2cBusResource* bus,
                                              const uint8_t* tx,
                                              size_t tx_length,
                                              size_t rx_length) {
  if (bus->operation_in_flight()) return ESP_ERR_INVALID_STATE;

  uint8_t* tx_buffer = null;
  if (tx_length > 0) {
    tx_buffer = unvoid_cast<uint8_t*>(heap_caps_malloc(
        tx_length, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if (tx_buffer == null) return ESP_ERR_NO_MEM;
    memcpy(tx_buffer, tx, tx_length);
  }

  uint8_t* rx_buffer = null;
  if (rx_length > 0) {
    rx_buffer = unvoid_cast<uint8_t*>(heap_caps_malloc(
        rx_length, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT));
    if (rx_buffer == null) {
      free(tx_buffer);
      return ESP_ERR_NO_MEM;
    }
  }

  bus->prepare_operation(tx_buffer, rx_buffer, rx_length);
  return ESP_OK;
}

static Object* finish_controller_operation(I2cBusResource* bus,
                                           uint8_t* destination,
                                           size_t destination_length,
                                           Process* process) {
  if (!bus->operation_in_flight()) FAIL(INVALID_STATE);
  ControllerResult result = controller_result(bus->completion_event());
  bool destination_too_small = bus->rx_length() > destination_length;
  if (result == CONTROLLER_RESULT_OK && bus->rx_length() > 0) {
    if (!destination_too_small) {
      memcpy(destination, bus->rx_buffer(), bus->rx_length());
    }
  }
  bus->finish_operation();
  if (result == CONTROLLER_RESULT_INVALID) FAIL(INVALID_STATE);
  if (destination_too_small) FAIL(OUT_OF_BOUNDS);
  return Smi::from(static_cast<int>(result));
}

PRIMITIVE(device_transfer_start) {
  ARGS(I2cDeviceResource, resource, Blob, tx_buffer, int, rx_length);
  if (resource->handle() == null) FAIL(ALREADY_CLOSED);
  if (rx_length < 0) FAIL(OUT_OF_BOUNDS);
  if (tx_buffer.length() == 0 && rx_length == 0) FAIL(INVALID_ARGUMENT);

  auto bus = resource->bus();
  esp_err_t err = prepare_controller_operation(
      bus, tx_buffer.address(), tx_buffer.length(), rx_length);
  if (err != ESP_OK) return Primitive::os_error(err, process);
  bool dispatched = false;
  Defer cancel_operation { [&] { if (!dispatched) bus->finish_operation(); } };

  if (tx_buffer.length() == 0) {
    err = i2c_master_receive(resource->handle(), bus->rx_buffer(), rx_length, 0);
  } else if (rx_length == 0) {
    err = i2c_master_transmit(resource->handle(), bus->tx_buffer(), tx_buffer.length(), 0);
  } else {
    err = i2c_master_transmit_receive(resource->handle(),
                                    bus->tx_buffer(), tx_buffer.length(),
                                    bus->rx_buffer(), rx_length, 0);
  }
  if (err != ESP_OK) return Primitive::os_error(err, process);
  dispatched = true;
  return process->null_object();
}

PRIMITIVE(device_transfer_finish) {
  ARGS(I2cDeviceResource, resource, MutableBlob, buffer, int, length);
  if (resource->handle() == null || resource->bus() == null) FAIL(ALREADY_CLOSED);
  if (length < 0 || length > buffer.length()) FAIL(OUT_OF_BOUNDS);
  return finish_controller_operation(
      resource->bus(), buffer.address(), length, process);
}

} // namespace toit

#endif // TOIT_ESP32
